In [5]:
import pandas as pd

In [6]:
a={'name':['a','b','c'],'language':['python','DS','python'],'marks':[23,45,67]}
a

{'name': ['a', 'b', 'c'],
 'language': ['python', 'DS', 'python'],
 'marks': [23, 45, 67]}

In [7]:
df=pd.DataFrame(a)
df.ndim

2

In [8]:
df.shape

(3, 3)

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df

  name language  marks
0    a   python     23
1    b       DS     45
2    c   python     67

In [11]:
df.name

0    a
1    b
2    c
Name: name, dtype: object

In [12]:
type(df.name)

pandas.core.series.Series

In [13]:
df=pd.read_csv('day4.csv')
df

  name language  marks
0    a   python     65
1    b       ds     45
2    c       ml     67
3    a   python     89
4    e       ds     43
5    b       ml     56
6    g   python     78
7    h       ds     69
8    i       ml     98
9    j   python     90

In [15]:
df.shape

(10, 3)

In [18]:
a=['a','b','c']
b=[45,67,78]
z=dict(zip(a,b))
z

{'a': 45, 'b': 67, 'c': 78}

In [19]:
df1=pd.DataFrame(z,index=[0,1,2,3,4])
df1

    a   b   c
0  45  67  78
1  45  67  78
2  45  67  78
3  45  67  78
4  45  67  78

In [20]:
s1=pd.Series(a)
s1

0    a
1    b
2    c
dtype: object

In [21]:
s2=pd.Series(b)
s2

0    45
1    67
2    78
dtype: int64

In [22]:
df

  name language  marks
0    a   python     65
1    b       ds     45
2    c       ml     67
3    d   python     89
4    e       ds     43
5    f       ml     56
6    g   python     78
7    h       ds     69
8    i       ml     98
9    j   python     90

In [23]:
df.marks

0    65
1    45
2    67
3    89
4    43
5    56
6    78
7    69
8    98
9    90
Name: marks, dtype: int64

In [24]:
df.marks>50

0     True
1    False
2     True
3     True
4    False
5     True
6     True
7     True
8     True
9     True
Name: marks, dtype: bool

In [25]:
df[df.marks>50]

  name language  marks
0    a   python     65
2    c       ml     67
3    d   python     89
5    f       ml     56
6    g   python     78
7    h       ds     69
8    i       ml     98
9    j   python     90

In [27]:
newdf=df[df.language=='python']

In [29]:
newdf.to_csv('newdata.csv')

In [30]:
newdf[newdf.marks>50]

  name language  marks
0    a   python     65
3    d   python     89
6    g   python     78
9    j   python     90

In [14]:
df[(df.language=='python')&(df.marks>50)]

  name language  marks
0    a   python     65
3    a   python     89
6    g   python     78
9    j   python     90

In [15]:
df[['name','marks']]

  name  marks
0    a     65
1    b     45
2    c     67
3    a     89
4    e     43
5    b     56
6    g     78
7    h     69
8    i     98
9    j     90

In [34]:
df[0:2]

  name language  marks
0    a   python     65
1    b       ds     45

In [37]:
df[-1:]

  name language  marks
9    j   python     90

In [2]:
import pandas as pd

In [5]:
df=pd.read_csv('day4.csv')
df

  name language  marks
0    a   python     65
1    b       ds     45
2    c       ml     67
3    a   python     89
4    e       ds     43
5    b       ml     56
6    g   python     78
7    h       ds     69
8    i       ml     98
9    j   python     90

In [6]:
df.groupby('name')['marks'].sum()

name
a    154
b    101
c     67
e     43
g     78
h     69
i     98
j     90
Name: marks, dtype: int64